app/controllers/api/v1/votes_controller.rb

  def create

    @review = Review.find(vote_params[:review_id])
    @station = @review.station
    @vote = Vote.find_by(user_id: current_user.id, review_id: @review.id)
    user_input = vote_params[:value].to_i

    if @vote
      if @vote.value == 0

        @vote.value = user_input
        @vote.save
        # "Your vote has been updated!"
      else
        if @vote.value == user_input
          # "You can only vote once!"
        else
          @vote.value = 0
          @vote.save
          # "Your vote has been updated!"
        end
      end
    else
      # add new vote
      binding.pry
      @vote = Vote.create(user_id: current_user.id, review_id: vote_params[:review_id], value: vote_params[:value])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."review_id" = $2 LIMIT $3  [["user_id", 1], ["review_id", 2], ["LIMIT", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."review_id" = $1  [["review_id", 2]]
UPDATE "votes" SET "value" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["value", 0], ["updated_at", 2016-10-25 13:39:19 UTC], ["id", 46]]
INSERT INTO "votes" ("user_id", "review_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["review_id", 2], ["value", 1], ["created_at", 2016-10-25 02:21:02 UTC], ["updated_at", 2016-10-25 02:21:02 UTC]]