app/controllers/reviews_controller.rb

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @station = Station.find(params[:station_id])
    @review = Review.find(params[:id])

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "content", "station_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "new review"], ["content", "yAAAsss"], ["station_id", 1], ["created_at", 2016-10-21 20:46:48 UTC], ["updated_at", 2016-10-21 20:46:48 UTC]]
---
  def create
    @station = Station.find(params[:station_id])
    @review = Review.new(review_params)
    @review.station = @station

    if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @review = Review.find(params[:id])
    @station = Station.find(params[:station_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "content" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["content", "hmmm"], ["updated_at", 2016-10-22 14:47:39 UTC], ["id", 2]]
SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def update
    @review = Review.find(params[:id])

    if @review.update(review_params)
      flash[:alert] = "Review successfully updated!"
      redirect_to station_review_path
    else
      flash[:alert] = "Please provide both a title and a review"
      @station = Station.find(params[:station_id])