app/controllers/stations_controller.rb

INSERT INTO "stations" ("name", "line", "state", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Benning Road"], ["line", "Blue"], ["state", "DC"], ["description", "A nice little station!"], ["created_at", 2016-10-20 17:57:27 UTC], ["updated_at", 2016-10-20 17:57:27 UTC]]
---
  def create

    @station = Station.new(station_params)

    if @station.save

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @station = Station.find(params[:id])

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @station = Station.find(params[:id])

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "stations" SET "description" = $1, "updated_at" = $2 WHERE "stations"."id" = $3  [["description", "The administration has threatened to close this station, among others"], ["updated_at", 2016-10-20 18:55:12 UTC], ["id", 154]]
---
  def update
    @station = Station.find(params[:id])

    if @station.update(station_params)

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 232], ["LIMIT", 1]]
DELETE FROM "stations" WHERE "stations"."id" = $1  [["id", 232]]
---
  def destroy
    @station = Station.find(params[:id])
    @station.destroy