app/controllers/votes_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."review_id" = $2 LIMIT $3  [["user_id", 1], ["review_id", 7], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."review_id" = $2 AND "votes"."value" = $3 LIMIT $4  [["user_id", 1], ["review_id", 8], ["value", 1], ["LIMIT", 1]]
UPDATE "votes" SET "value" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["value", -1], ["updated_at", 2016-10-24 17:27:31 UTC], ["id", 33]]
INSERT INTO "votes" ("user_id", "review_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["review_id", 7], ["value", 1], ["created_at", 2016-10-24 15:05:40 UTC], ["updated_at", 2016-10-24 15:05:40 UTC]]
---
  def create

    @review = Review.find(vote_params[:review_id])
    @station = @review.station
    @vote = Vote.find_by(user_id: current_user.id, review_id: @review.id)
    user_input = vote_params[:value].to_i

    if @vote
      if @vote.value == 0

        @vote.value = user_input
        @vote.save
        flash[:alert] = "Your vote has been updated!"
        redirect_to @station
      else
        if @vote.value == user_input

          flash[:error] = "You can only vote once!"
          redirect_to @station
        else
          @vote.value = 0
          @vote.save

          flash[:alert] = "Your vote has been updated!"
          redirect_to @station
        end
      end
    else
      # add new vote
      @vote = Vote.create(vote_params)