app/views/admin/users/index.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."first_name" DESC
---

    <li><%= user.first_name %> <%= user.last_name %> (<%= link_to "Delete User", admin_user_path(user), method: :delete, id: "user-delete-#{user.id}", class: "user-delete" %>)</li>